In [22]:
import pandas as pd

tabela = pd.read_excel("dados//Deletar_Linhas_Colunas.xlsx")

display(tabela)

           Vendedor Produto Data Venda  Total Vendas
0   Rodolfo Martins       - 2023-01-02       2143.50
1   Ismael Silveira       - 2023-01-07       9567.50
2     Rodrigo Pires       - 2023-01-12       4567.50
3    Amanda Martins     NaN 2023-01-17       1485.60
4    Eliane Moreira       - 2023-01-22        139.98
5   Gabriel Cardoso       - 2023-01-27        448.28
6  Leonardo Almeida       - 2023-02-01        719.92
7   Nicolas Pereira       - 2023-02-06        306.80
8      Paulo Santos     NaN 2023-02-11        876.84

In [23]:
import pandas as pd

tabela = pd.read_excel("dados//Deletar_Linhas_Colunas.xlsx")

#Dropna(): Deleta linhas que tem pelo menos um valor em branco
deletando_Linhas_em_branco = tabela.dropna()

display(deletando_Linhas_em_branco)

           Vendedor Produto Data Venda  Total Vendas
0   Rodolfo Martins       - 2023-01-02       2143.50
1   Ismael Silveira       - 2023-01-07       9567.50
2     Rodrigo Pires       - 2023-01-12       4567.50
4    Eliane Moreira       - 2023-01-22        139.98
5   Gabriel Cardoso       - 2023-01-27        448.28
6  Leonardo Almeida       - 2023-02-01        719.92
7   Nicolas Pereira       - 2023-02-06        306.80

In [24]:
import pandas as pd

tabela = pd.read_excel("dados//Deletar_Linhas_Colunas.xlsx")

#Dropna(): Deleta linhas que tem pelo menos um valor em branco
deletando_Linhas_em_branco = tabela.dropna()

#Del identificador["nome_da_coluna"] - Deleta a coluna que especificarmos
del deletando_Linhas_em_branco["Produto"]

display(deletando_Linhas_em_branco)

           Vendedor Data Venda  Total Vendas
0   Rodolfo Martins 2023-01-02       2143.50
1   Ismael Silveira 2023-01-07       9567.50
2     Rodrigo Pires 2023-01-12       4567.50
4    Eliane Moreira 2023-01-22        139.98
5   Gabriel Cardoso 2023-01-27        448.28
6  Leonardo Almeida 2023-02-01        719.92
7   Nicolas Pereira 2023-02-06        306.80

In [26]:
import pandas as pd

tabela = pd.read_excel("dados//Deletar_Linhas_Colunas.xlsx")

#Dropna(): Deleta linhas que tem pelo menos um valor em branco
deletando_linhas_em_branco = tabela.dropna()

#Drop(columns = "col1", "col2"..."coln") - Deleta uma ou mais colunas
deletando_duas_colunas = deletando_linhas_em_branco.drop(columns = ["Produto", "Data Venda"])

display(deletando_duas_colunas)

           Vendedor  Total Vendas
0   Rodolfo Martins       2143.50
1   Ismael Silveira       9567.50
2     Rodrigo Pires       4567.50
4    Eliane Moreira        139.98
5   Gabriel Cardoso        448.28
6  Leonardo Almeida        719.92
7   Nicolas Pereira        306.80

In [27]:
import pandas as pd

tabela = pd.read_excel("dados//Deletar_Linhas_Colunas.xlsx")

#Dropna(): Deleta linhas que tem pelo menos um valor em branco
deletando_linhas_em_branco = tabela.dropna()

#Drop(columns = "col1", "col2"..."coln") - Deleta uma ou mais colunas
deletando_duas_colunas = deletando_linhas_em_branco.drop(columns = ["Produto", "Data Venda"])

#axis = eixo(0 - linha/ 1 = column). 
deletandoLinha3 = deletando_duas_colunas.drop(2,axis=0) 

#Deletando duas linhas.
deletandoDuasLinhas = deletandoLinha3.drop([0,1], axis = 0)

display(deletandoDuasLinhas)

           Vendedor  Total Vendas
4    Eliane Moreira        139.98
5   Gabriel Cardoso        448.28
6  Leonardo Almeida        719.92
7   Nicolas Pereira        306.80